ams/src/Documents/_ПоступлениеИзПереработки/_ПоступлениеИзПереработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>_ПоступлениеИзПереработки</name>
  <registerRecords>AccumulationRegister._ТоварыПереданные</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеНедостачТоваров</name>
    <type>
      <types>DocumentRef.СписаниеНедостачТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>Для списания материалов</comment>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/AccumulationRegisters/_ТоварыПереданные/_ТоварыПереданные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>_ТоварыПереданные</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef._ВозвратИзПереработки</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ams/src/Documents/_ПоступлениеИзПереработки/Forms/ПодборБрака/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	Данные = ПолучитьИзВременногоХранилища(Параметры.АдресВХранилище);

	ЗаполнитьТаблицуПодбора(Данные);

	КоличествоСтрок = Товары.Количество();
	Элементы.Товары.Высота = КоличествоСтрок + 1;

	Высота = КоличествоСтрок + 5;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), НСтр(
			"ru = 'Данные были изменены. Перенести изменения в документ?'"), РежимДиалогаВопрос.ДаНет);

	Иначе
		ПеренестиТоварыВДокумент();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокументВыполнить()
	ПеренестиТоварыВДокумент();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуПодбора(Данные)
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Данные.Товары);
	Запрос.УстановитьПараметр("Дата", Данные.Дата);
	Запрос.УстановитьПараметр("Склад", Данные.Склад);
	Запрос.УстановитьПараметр("Контрагент", Данные.Контрагент);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Количество КАК Количество
	|ПОМЕСТИТЬ док
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыПереданныеОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыПереданныеОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ост
	|ИЗ
	|	РегистрНакопления._ТоварыПереданные.Остатки(&Дата, Контрагент = &Контрагент) КАК ТоварыПереданныеОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	док.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	док КАК док
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ост.Номенклатура
	|ИЗ
	|	ост КАК ост
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	вт КАК вт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тов.Номенклатура КАК Номенклатура,
	|	ост.КоличествоОстаток КАК ВПереработке,
	|	док.Количество КАК Количество
	|ИЗ
	|	тов КАК тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ост КАК ост
	|		ПО тов.Номенклатура = ост.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ док КАК док
	|		ПО тов.Номенклатура = док.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	тов.Номенклатура.Наименование";

	Результат = Запрос.Выполнить();
	Товары.Загрузить(Результат.Выгрузить());

	Элементы.ТоварыОстатокНаСкладе.Заголовок = "Остаток на " + Данные.Дата;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		ПеренестиТоварыВДокумент();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиТоварыВДокумент()
	// Снятие модифицированности, т.к. перед закрытием признак проверяется.
	Модифицированность = Ложь;

	Массив = Новый Массив;

	Для Каждого Стр Из Товары Цикл
		Если Стр.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;

		Массив.Добавить(Новый Структура("Номенклатура,Количество", Стр.Номенклатура, Стр.Количество));
	КонецЦикла;

	Закрыть(Массив);
КонецПроцедуры

#КонецОбласти
